Repository: raf93278/Captain-Tsubasa
Catalog: omegat/project_save.tmx
Source language: en_gb
Languages: pl

source: Hmm... 'Sides the fact that I blocked it,\nI admit of all the shots I've taken, its power,\nspeed, and rotation were all top-notch.
pl: Hmm... Pomijając fakt, że go zablokowałem, przyznaję, że ze wszystkich strzałów jego moc, prędkość i rotacja były na najwyższym poziomie.

# Hmm... Well, I can't let him outplay me.
source: Hmm...\nWell, I can't let him outplay me.
pl: Hmm...\nCóż, nie mogę pozwolić, aby mnie pokonał.

source: Hold <rep dribble_hold> in order to speed\nup your dribble by consuming Spirit.\nYou can dodge the opponent's tackle\n(<rep ①>/<rep ⑧>) by using Spirit,\nbut the ball will be stolen if you're\nout of Spirit.
pl: Przytrzymaj <rep dribble_hold> by przyspieszyć\ndrybling poprzez użycie Ducha.\nMożesz uniknąć ataku przeciwnika\n(<rep ①>/<rep ⑧>) używając Ducha,\nale piłka zostanie przejęta, jeśli go zabraknie.

source: Hold <rep dribble_hold> while Dribbling in order\nto execute an even faster Dash Dribble.
pl: Przytrzymaj <rep dribble_hold> podczas dryblingu,\naby wykonać Dash Dribble.

source: Holding the button down will fill \nup the Kick Gauge, and the longer you hold it \nthe more powerful the shot will be.
pl: Przytrzymanie przycisku spowoduje napełnienie \nWskaźnika Kopnięcia, a im dłużej go przytrzymasz, \ntym mocniejszy będzie strzał.

source: How about that, Alberto!
pl: Co ty na to, Alberto!

source: How about this!
pl: Co powiesz na to!

# How do I make it even harder to stop than it already is?)
source: How do I make\nit even harder to stop than it already is?)
pl: Jak sprawić, aby zatrzymanie było jeszcze trudniejsze niż jest teraz?)

# How would you compare my Neo Drive Shot today to how it was at Nationals?
source: How would you compare my Neo Drive Shot\ntoday to how it was at Nationals?
pl: Jak porównałbyś mój dzisiejszy strzał Neo Drive\nz tym, jak wypadł na mistrzostwach krajowych?

# How's Wakabayashi been faring on his study abroad in Germany?
source: How's Wakabayashi been faring\non his study abroad in Germany?
pl: Jak radzi sobie Wakabayashi podczas\nstudiów za granicą w Niemczech?

source: How's that, Rensenbrink?!
pl: I jak, Rensenbrink?!

source: Hrm, I can tell ya been thinkin' hard about this.\nYa know, ya can always come to me for help if ya\nneed it.
pl: Widać, że mocno nad tym myślałeś. Wiesz, zawsze możesz\nprzyjść do mnie po pomoc, jeśli jej potrzebujesz.

source: Huh?
pl: Co?

source: Hyah!
pl: Hej!

source: I WILL score!
pl: Zdobędę bramkę!

source: I also hear he scored the winning goal at the\nOsaka finals, so there's a chance he could\njoin in on the offense, too.
pl: Słyszałem, że strzelił zwycięskiego gola w\nfinałach w Osace, więc jest szansa, że ​​również\ndołączy do ataku.

# I also know you were at last year's Nagasaki Regionals.
source: I also know you were\nat last year's Nagasaki Regionals.
pl: Wiem też, że brałeś udział w zeszłorocznych zawodach prefektury w Nagasaki.

source: I bet that very Drive Shot you used during the\nArgentina match is what got him fired up as a\ngoalkeeper.
pl: Założę się, że właśnie ten Drive Shot, którego użyłeś podczas meczu z Argentyną, sprawił, że stał się on bramkarzem.

source: I came out on top this time.
pl: Tym razem jest górą.

source: I came to talk to you about a video\nof your play I sent to some pro teams in Brazil.
pl: Przyszedłem porozmawiać z tobą o filmie z twoją grą,\nktóry wysłałem do kilku profesjonalnych drużyn w Brazylii.

source: I can hold my own, Jito!
pl: Dam radę, Jito!

source: I can read you like a book, Taki!
pl: Czytam z ciebie jak z książki, Taki!

# I can’t hear yooou! Give me some energy!
source: I can’t hear yooou!\nGive me some energy!
pl: Nie słyszę was! Dodajcie mi energii!//

# I did not know ping-pong balls could curve like that.
source: I did not know ping-pong balls\ncould curve like that.
pl: Nie wiedziałem, że piłeczki pingpongowe\nmogą się tak zakrzywiać.

source: I didn't think so at first, but when we tried it\nI realized I couldn't play regularly.\nAnd I decided I couldn't let myself lose.
pl: Z początku tak nie myślałem, ale kiedy spróbowaliśmy,\nzdałem sobie sprawę, że nie mogę grać regularnie.\nI zdecydowałem, że nie mogę pozwolić sobie na przegraną.

source: I do anything it takes...
pl: Zrobię wszystko, co trzeba...

# I don't care if there are four of you. Nothing's stopping me!
source: I don't care if there are four of you.\nNothing's stopping me!
pl: Nie obchodzi mnie, czy jest was czworo.\nNic mnie nie powstrzyma!

source: I don't know...
pl: Nie mam pojęcia...

source: I don't really have much to say.
pl: Właściwie nie mam wiele do powiedzenia.

source: I don't see the fire anymore.
pl: Nie widzę już ognia.

source: I don't think so, Takeshi!
pl: Nie wydaje mi się, Takeshi!

source: I doubt he even needs my coaching anymore.
pl: Wątpię, by potrzebował mojej pomocy.

source: I entrust my dreams to this ball.
pl: Powierzam moje marzenia tej kuli.

source: I felt like I could probably stop it if I had a\nfew more chances to battle it out.
pl: Czułem, że mógłbym do niego nie dopuścić,\ngdybym miał jeszcze kilka szans na walkę.

# I finally pulled it off! The no-trap running volley Falcon Shot!
source: I finally pulled it off!\nThe no-trap running volley Falcon Shot!
pl: W końcu się udało!\nThe no-trap running volley Falcon Shot!//

source: I get it.
pl: Rozumiem.

source: I got it this time.
pl: Tym razem się udało.

# I got lost in my thoughts for a second there.
source: I got lost\nin my thoughts for a second there.
pl: Zamyśliłem się.

source: I got the shot past him at Nationals!)
pl: Udało mi się go wyprzedzić na mistrzostwach krajowych!)

source: I guess that's a sort of creativity when it comes\nto soccer, even if it's a little different from\nours.
pl: Myślę, że jest to rodzaj kreatywności, jeśli chodzi o piłkę nożną, nawet jeśli jest ona trochę inna od naszej.

source: I had absolute confidence in my strength,\nbut in that moment, you overpowered me.
pl: Miałem całkowitą pewność w swoją siłę,\nale w tym momencie mnie pokonałeś.

# I hate to admit that keeps me driven, but it's the truth.
source: I hate to admit\nthat keeps me driven, but it's the truth.
pl: Nienawidzę przyznawać, że to mnie motywuje,\nale taka jest prawda.

source: I have to at least score this one shot!
pl: Muszę strzelić tego gola!

source: I have to do this.)
pl: Muszę to zrobić.)

source: I have to figure this out.)
pl: Muszę to rozgryźć.)

# I hear most of them have been playing together since Meiwa elem.
source: I hear most of them have been playing\ntogether since Meiwa elem.
pl: Słyszałem, że większość z nich gra\nrazem od czasów eliminacji Meiwa.

source: I hear they call him the Ace Killer because\nhe likes to target other teams' aces.
pl: Słyszałem, że nazywają go Zabójcą Asów, ponieważ lubi atakować asów innych drużyn.

# I hear they have the best teamwork in the tournament.
source: I hear\nthey have the best teamwork in the tournament.
pl: Słyszałem, że mają najlepszą pracę zespołową w turnieju.

source: I heard back from a lot of teams.\nYou've really caught their attention.\nSome couldn't believe you're really fourteen.
pl: Otrzymałem odpowiedzi od wielu drużyn.\nPrzykułeś ich uwagę.\nNiektórzy nie mogli uwierzyć, że naprawdę masz czternaście lat.

source: I know what you're doing, Heine!
pl: Wiem, co robisz, Heine!

source: I know.
pl: Wiem.

source: I like that look in your eyes!
pl: Podoba mi się to spojrzenie!

source: I mean, I get it.
pl: Rozumiem.

source: I played along, but it was so different from what\nI was used to that even trapping the ball became a\nchallenge.
pl: Grałem, ale było to tak różne od tego, do czego byłem\n przyzwyczajony, że nawet złapanie piłki stało się wyzwaniem.

source: I remember.
pl: Pamiętam.

source: I represent the Japan Soccer Association.
pl: Reprezentuję Japoński Związek Piłki Nożnej.

source: I see.
pl: Rozumiem.

# I see... Okay, that gives me something to work with.
source: I see...\nOkay, that gives me something to work with.
pl: Rozumiem... To daje mi coś do pracy.

# I should show you my Razor Serve sometime.
source: I should show you my Razor Serve\nsometime.
pl: Powinienem kiedyś pokazać ci mój Razor Serve.

# I study my game as much as I study each school's ace.
source: I study my game as much as\nI study each school's ace.
pl: Studiuję swoją grę tak samo, jak studiuję asy każdej szkoły.

source: I think I kinda get it.
pl: Myślę, że trochę to rozumiem.

source: I think I prefer regular soccer.
pl: Chyba wolę zwykłą piłkę nożną.

source: I thought that one came out just right.
pl: Uważam, że ten wyszedł w sam raz.

# I want to know what you really thought. Don't sugarcoat it.
source: I want to know what you really thought.\nDon't sugarcoat it.
pl: Chcę wiedzieć, co naprawdę myślałeś.\Nie owijaj w bawełnę.

# I want to see if my new Drive Shot can work on him.
source: I want to see if my new Drive Shot can work on\nhim.
pl: Chcę sprawdzić, czy mój nowy Drive Shot zadziała na niego.

source: I was gonna do some studying.
pl: Chciałem się trochę pouczyć.

source: I was gonna go practice.
pl: Miałem iść poćwiczyć.

source: I will win!
pl: Wygram!

source: I win, Kaiser!
pl: Wygrałem, Kaiser!

source: I win, Robson!
pl: Wygrałem, Robson!

source: I win, Schester!
pl: Wygrałem, Schester!

source: I won't hold anything back, Misugi!
pl: Nie będę niczego ukrywać, Misugi!

source: I won't lose to you, Margus!
pl: Nie przegram z tobą, Margus!

source: I won't lose to you, Schneider!
pl: Nie przegram z tobą, Schneider!

source: I won't lose, Misaki!
pl: Nie przegram, Misaki!

source: I would've been shocked if it hadn't gone in.
pl: Byłbym zszokowany, gdyby nie wszedł.

source: I wouldn't want it any other way!
pl: Nie chciałbym, aby było inaczej!

# I'd been looking for you guys. There's something I wanted to talk about.
source: I'd been looking for you guys.\nThere's something I wanted to talk about.
pl: Szukałem was.\nChciałem o czymś porozmawiać.

source: I'd expect nothing less, Misaki.
pl: Niczego innego bym nie oczekiwał, Misaki.

# I'd love to see you perfect it. I know you won't let me down.
source: I'd love to see you perfect it.\nI know you won't let me down.
pl: Chciałbym zobaczyć, jak to udoskonalasz.\nWiem, że mnie nie zawiedziesz.

source: I'll be the world's best soccer player!
pl: Będę najlepszym piłkarzem na świecie!

source: I'll do my best, Coach.
pl: Dam z siebie wszystko, trenerze.

# I'll keep what you both asked in mind when I divide up teams for practice today.
source: I'll keep what you both asked in mind when\nI divide up teams for practice today.
pl: Będę mieć na uwadze to, o co prosiliście,\njak będę dzielił zespoły na dzisiejszy trening.

source: I'll never forgive you if you lose, Tsubasa.
pl: Nigdy ci nie wybaczę, jeśli przegrasz, Tsubasa.

source: I'll play 'til the last kick!
pl: Będę grał do ostatniego kopnięcia!

source: I'll show you how good I am!)
pl: Pokażę ci, jaki jestem dobry!)

source: I'll take you every time, Nitta!
pl: Ogram cię za każdym razem, Nitta!

# I'm a busy man, you know. I'm touring the country after this. Places to go.
source: I'm a busy man, you know.\nI'm touring the country after this.\nPlaces to go.
pl: Jestem zajętym człowiekiem, wiesz. Potem zwiedzam kraj. Miejsca do odwiedzenia.

source: I'm a cut above you, Diaz!
pl: Jestem o klasę wyżej, Diaz!

source: I'm fine.
pl: Wszystko gra.

source: I'm here, Coach Kira.
pl: Jestem, trenerze Kira.

source: I'm impressed, Taki.
pl: Jestem pod wrażeniem, Taki.

source: I'm in!
pl: Wchodzę!

source: I'm not gonna lose, Hyuga!
pl: Nie przegram, Hyuga!

# I'm not letting our dream die here!
source: I'm not letting our dream\ndie here!
pl: Nie pozwolę, żeby nasze marzenie tutaj umarło!

source: I'm not losing next time, Napoleon!
pl: Następnym razem nie przegram, Napoleonie!

source: I'm not losing to you, Kluivoort!
pl: Nie przegram z tobą, Kluivoort!

source: I'm sorry.
pl: Przepraszam.

source: I'm sure he's out there somewhere,\nstill playing the beautiful game.\nI know he must be.
pl: Jestem pewien, że on gdzieś tam jest i nadal gra w tę piękną grę.\nWiem, że na pewno tam jest.

# I'm sure the one most pleased by this turn of events was Tsubasa himself.
source: I'm sure the one most pleased by this turn of\nevents was Tsubasa himself.
pl: Jestem pewien, że najbardziej zadowolony z takiego\nobrotu spraw był sam Tsubasa.

source: I'm sure we're all nervous because this is the\nfirst game of Nationals, but it's also the first\nstep toward our third championship victory!
pl: Jestem pewien, że wszyscy jesteśmy zdenerwowani, ponieważ jest to\npierwszy mecz w mistrzostwach krajowych, a to także pierwszy\nkrok w kierunku naszego trzeciego zwycięstwa w mistrzostwach!

# I'm sure you built up a good sweat, so I brought some towels.
source: I'm sure you built up a good sweat,\nso I brought some towels.
pl: Jestem pewien, że nieźle się spociliście, więc przyniosłem kilka ręczników.

# I've barely had time to recover from the last time you surprised me.
source: I've barely had time to\nrecover from the last time you surprised me.
pl: Ledwo zdążyłem dojść do siebie po tym, jak ostatnio mnie zaskoczyłeś.

source: I've been asked to put you on a particular team\nfor today's practice match.\nBy two players, in fact.
pl: Poproszono mnie, abym wystawił cię w konkretnej drużynie na dzisiejszy mecz treningowy.\nWłaściwie to dwóch zawodników.

source: I've got it!
pl: Mam ją!

source: I've got technique, too, Victorino!
pl: Też mam technikę, Victorino!

# I've learned a lot about how to put a good spin on the ball to make it curve.
source: I've learned a lot about how to put a good spin\non the ball to make it curve.
pl: Nauczyłem się wiele o tym, jak dobrze podkręcać piłkę.

source: I've opened up a soccer school in Okinawa.
pl: Otworzyłem szkołę piłki nożnej na Okinawie.

source: I've waited for this!
pl: Czekałem na to!

# I-I can't do that! That was a wager between men!
source: I-I can't do that!\nThat was a wager between men!
pl: Nie mogę! To był zakład między mężczyznami!

source: I-I did it!
pl: Udało się!

source: I-I...
pl: Ja...

source: If I said I'll win, I'll win!
pl: Jeśli powiedziałem, że wygram, to wygram!

source: If I stick to attacking, Nitta will be Otomo's\nonly offensive player, and he'll be unchallenged.
pl: Jeśli pozostanę przy atakowaniu, Nitta będzie jedynym ofensywnym zawodnikiem Otomo i nie będzie miał sobie równych.

# If Nankatsu wants a third Nationals victory, they need to turn this around!
source: If Nankatsu wants a third Nationals victory, they\nneed to turn this around!
pl: Jeśli Nankatsu chce trzeciego zwycięstwa w mistrzostwach krajowych, musi to odwrócić!

source: If he wants to play, then please let him.
pl: Jeśli chce grać, to proszę, pozwól mu.

# If it gets taken, take it back. That's the first rule of soccer.
source: If it gets taken, take it back.\nThat's the first rule of soccer.
pl: Jeśli zostanie zabrana, zabierz ją z powrotem.\nTo pierwsza zasada piłki nożnej.

source: If only I'd--
pl: Gdybym tylko...

source: If someone gets the ball and then they loft it\nto the front line, then you know that's what's\ncoming next.
pl: Jeśli ktoś dostaje piłkę i podaje ją do przodu, to wiadomo, co będzie dalej.

source: If the brothers head up field, quickly check\nwho has the ball, and keep them from making a\nlong pass!
pl: Jeśli bracia ruszą w górę boiska, szybko sprawdźcie, kto ma piłkę i powstrzymajcie ich przed wykonaniem długiego podania!

source: If the drive earlier was like Tsubasa's shot,\nwhat we just saw was like Hyuga's Tiger Shot.
pl: Jeśli wcześniejszy drive był podobny do strzału Tsubasy,\nto, co właśnie widzieliśmy, przypominało Tiger Shot Hyugi.

source: If they take it, we just take it back!
pl: Jeśli ją zabiorą, to ją odzyskamy.

source: If we can get everyone to fall on the ball with an\navalanche attack, we'll definitely break through!\nWe should shatter Otomo's defenses together!
pl: Jeśli uda nam się zmusić wszystkich do ataku lawinowego, na pewno się przebijemy! Powinniśmy razem zniszczyć obronę Otomo!

source: If we want a perfect championship,\nwe certainly can't lose in the first match!\nI'm sure you're nervous, but we can do this!
pl: Jeśli chcemy idealnych mistrzostw,z pewnością nie\nmożemy przegrać w pierwszym meczu! Jestem pewien, że się\ndenerwujesz, ale możemy to zrobić!

source: If we win again this year, we'll be remembered\nas the first three-time national champs.
pl: Jak w tym roku ponownie wygramy, zostaniemy zapamiętani\njako pierwsi trzykrotni mistrzowie zawodów krajowych.

# If we win this one we can finally move on to Nationals, so good luck!
source: If we win this one we can finally\nmove on to Nationals, so good luck!
pl: Jak wygramy ten mecz, możemy awansować na zawody krajowe, więc powodzenia!

source: If you can muster that fighting spirit, you'll\nfind what you had and what you're looking for.
pl: Jeśli zdołasz wzbudzić w sobie ducha walki,\nznajdziesz to, co miałeś i czego szukasz.

# If you don't want to lose to Tsubasa Ozora, that is.
source: If you don't\nwant to lose to Tsubasa Ozora, that is.
pl: Znaczy się, jeśli nie chcesz przegrać z Tsubasą Ozorą.

# If you think you can stop my Drive Shot, be my guest!
source: If you think you can stop my Drive Shot,\nbe my guest!
pl: Myślisz, że możesz powstrzymać mój Drive Shot!

source: If you want to pull him from the game today...
pl: Jeśli chcesz wycofać go z dzisiejszego meczu...

source: In Freestyle Matches, players have drop\nrates for items, and the moves they can\nuse differ from those in regular modes.
pl: W meczach Freestyle gracze mają obniżone\nstawki za przedmioty, a ruchy, których mogą użyć,\nróżnią się od tych w zwykłych trybach.

source: In addition, by purchasing the DLC, you\ncan play the third mode, EPISODE: RISING\nSTARS.
pl: Dodatkowo, kupując DLC, możesz\nzagrać w trzeci tryb, EPIZOD: WSCHODĄCE\n GWIAZDY.

source: In both stories, the match settings are optimized\nto fit the story, so they cannot be changed.\nEPISODE: TSUBASA is recommended for new players\ngetting used to the game, and EPISODE: NEW HERO\nis for those with a little experience under\ntheir belt.
pl: W obu historiach ustawienia meczu są zoptymalizowane\npod kątem fabuły, więc nie można ich zmienić.\nEPIZOD: TSUBASA jest zalecany dla nowych graczy, którzy dopiero przyzwyczajają się do gry, a EPIZOD: NOWY BOHATER\n dla tych, którzy mają już trochę doświadczenia.

source: In fact, Nankatsu MS has yet to taste defeat,\nsince their captain, Tsubasa Ozora, enrolled!
pl: Tak naprawdę MS Nankatsu nie zaznało jeszcze smaku porażki, odkąd ich kapitanem jest Tsubasa Ozora!

source: In it, you'll experience a story\nwhere the players find new ways to grow\nand matches with missions.
pl: Przeżyjesz w nim historię,\nw której gracze znajdują nowe sposoby na rozwój\ni mecze z misjami.

# In order for Tsubasa to improve even more, he needs more rivals like Nitta.
source: In order for Tsubasa to improve even more,\nhe needs more rivals like Nitta.
pl: Aby Tsubasa mógł się jeszcze bardziej poprawić,\npotrzebuje więcej rywali takich jak Nitta.

# In terms of total team strength, I'd say we're about equal.
source: In terms of total team strength, I'd say we're\nabout equal.
pl: Jeśli chodzi o całkowitą siłę drużyny, powiedziałbym, że jesteśmy mniej więcej równi.

# In that regard, I have very high expectations for you, Jito.
source: In that regard, I have very high\nexpectations for you, Jito.
pl: Pod tym względem mam wobec ciebie bardzo\nwysokie oczekiwania, Jito.

source: In the end, even with Misugi literally\nputting his life on the line, Musashi\ncouldn't take down Toho!
pl: Ostatecznie, nawet gdy Misugi dosłownie ryzykował życiem, Musashi nie było w stanie pokonać Toho!

source: In the first half we saw a hat trick from Toho\nAcademy's Hyuga, the national record holder for\nmost goals two years running!
pl: W pierwszej połowie Hyuga z akademi Toho zaliczył hat-tricka,\nrekordzista kraju pod względem większości bramek przez dwa lata z rzędu!

source: Indeed.
pl: Istotnie.

source: Is he going to take the shot?!
pl: Czy zamierza oddać strzał?!

source: Is that so?
pl: Czyżby?

source: Is this their chance?!
pl: Czy to jest ich szansa?!

source: Ishida supports the front line from midfield\nby moving the ball effortlessly forward with his\noutstanding ball control.
pl: Ishida wspiera linię ataku ze środka pola,\npopychając piłkę do przodu bez wysiłku,\ndzięki swojej doskonałej kontroli nad piłką.

# Ishizaki. This year, we're taking that banner home.
source: Ishizaki.\nThis year, we're taking that banner home.
pl: Ishizaki.\nW tym roku zabieramy sztandar do domu.

source: It ain't gonna happen!
pl: Nic z tego!

source: It also seems they want you to play very\naggressively, so you get penalized for extended\npossession.
pl: Wygląda również na to, że chcą, abyście grali bardzo agresywnie, \nwięc zostaniecie ukarani za przedłużone posiadanie.

source: It does look like, because of its\nstrong rotation, it has flex and force on top\nof speed.
pl: Wygląda na to, że ze względu na silną rotację, ma elastyczność i siłę przy większej prędkości.

source: It may turn into a bit of a brawl.
pl: Może się to przerodzić w małą bijatykę.

source: It might be a good idea to keep one of them\nmarked at all times so they can't coordinate!
pl: Dobrym pomysłem może być pilnowanie jednego z nich przez cały czas, by nie mogli się skoordynować!

source: It should be no surprise that the favorites to\nwin are last year's winners, Nankatsu MS!
pl: Nie powinno być zaskoczeniem, że faworytami do zwycięstwa są zeszłoroczni zwycięzcy, MS Nankatsu!

# It was the need to mean something that got us this far.)
source: It was the need to mean something\nthat got us this far.)
pl: To właśnie potrzeba znaczenia czegoś doprowadziła nas tak daleko).

# It was worth comin' all the way out here jus' ta see 'em.
source: It was worth comin' all the way\nout here jus' ta see 'em.
pl: Warto było przyjechać aż tutaj, żeby ich zobaczyć.

# It was your skills that brought us even this far.
source: It was your\nskills that brought us even this far.
pl: To twoje umiejętności doprowadziły nas aż tak daleko.

source: It wasn't quite there.
pl: To nie było to.

# It wasn't simply power. I really think it was your fighting spirit.
source: It wasn't simply power.\nI really think it was your fighting spirit.
pl: To nie była zwykła moc.\nNaprawdę myślę, że to był twój duch walki.

source: It wasn't technique.
pl: To nie była technika.

# It will recover slowly while moving normally and not using special moves.
source: It will\nrecover slowly while moving normally and not\nusing special moves.
pl: Będzie powoli\nsię regenerować gdy będziesz poruszać się normalnie i nie\nużywać specjalnych ruchów.

source: It won't be that easy, Soda!
pl: To nie będzie proste, Soda!

# It would be pretty cool to graduate without a single loss.
source: It would be pretty cool to graduate\nwithout a single loss.
pl: Fajnie byłoby ukończyć grę bez ani jednej porażki.

source: It's a bit late for that now.
pl: Teraz jest już na to trochę za późno.

source: It's a simple strategy, but an effective one.\nThe strength of their defense and the speed of\ntheir offense are without a doubt Nationals-level.
pl: To prosta strategia, ale skuteczna. Siła ich obrony i szybkość ataku są bez wątpienia na poziomie krajowym.

source: It's all up to you, Honma!
pl: Wszystko zależy od ciebie, Honma!

# It's been four years since those two fruitful encounters.
source: It's been four years since those two fruitful\nencounters.
pl: Od tych dwóch owocnych spotkań minęły cztery\nlata.

# It's been so long since someone's fired me up like this.)
source: It's been so long since\nsomeone's fired me up like this.)
pl: Tak dawno nikt mnie tak nie rozpalił).

source: It's bound to become a tougher shot to stop!)
pl: To będzie trudniejszy strzał do zatrzymania!)
